<%@ Page Language="C#" AutoEventWireup="true" CodeFile="cities.aspx.cs" Inherits="Json_cityJson" %>
<%--100001 临安  100002 呼和浩特--%>
{
    "code": 200,
    "message": "success",
    "data": {
        "normalCityNum": 354,
        "hotCities": [
            {
                "id": 802102,
                "name": "北京"
            },
            {
                "id": 807802,
                "name": "广州"
            },
            {
                "id": 808802,
                "name": "杭州"
            },
            {
                "id": 818602,
                "name": "南京"
            },
            {
                "id": 822702,
                "name": "上海"
            },
            {
                "id": 828502,
                "name": "武汉"
            },
            {
                "id": 835502,
                "name": "郑州"
            },
            {
                "id": 827302,
                "name": "温州"
            }
        ],
        "hotCityNum": 8,
        "normalCity": [
            {
                "initial": "A",
                "cities": [
                    {
                        "id": 800102,
                        "name": "阿坝"
                    },
                    {
                        "id": 800202,
                        "name": "阿克苏"
                    },
                    {
                        "id": 800302,
                        "name": "阿拉尔"
                    },
                    {
                        "id": 800402,
                        "name": "安康"
                    },
                    {
                        "id": 800502,
                        "name": "安宁"
                    },
                    {
                        "id": 800602,
                        "name": "安庆"
                    },
                    {
                        "id": 800702,
                        "name": "安顺"
                    },
                    {
                        "id": 800802,
                        "name": "安阳"
                    },
                    {
                        "id": 800902,
                        "name": "鞍山"
                    },
                    {
                        "id": 807502,
                        "name": "广安"
                    },
                    {
                        "id": 807602,
                        "name": "广汉"
                    },
                    {
                        "id": 807702,
                        "name": "广元"
                    },
                    {
                        "id": 807802,
                        "name": "广州"
                    }
                ]
            },
            {
                "initial": "B",
                "cities": [
                    {
                        "id": 801002,
                        "name": "巴彦淖尔"
                    },
                    {
                        "id": 801102,
                        "name": "白城"
                    },
                    {
                        "id": 801202,
                        "name": "白山"
                    },
                    {
                        "id": 801302,
                        "name": "百色"
                    },
                    {
                        "id": 801402,
                        "name": "蚌埠"
                    },
                    {
                        "id": 801502,
                        "name": "包头"
                    },
                    {
                        "id": 801702,
                        "name": "宝鸡"
                    },
                    {
                        "id": 801802,
                        "name": "保定"
                    },
                    {
                        "id": 801902,
                        "name": "保山"
                    },
                    {
                        "id": 802002,
                        "name": "北海"
                    },
                    {
                        "id": 802102,
                        "name": "北京"
                    },
                    {
                        "id": 802202,
                        "name": "本溪"
                    },
                    {
                        "id": 802302,
                        "name": "毕节"
                    },
                    {
                        "id": 802402,
                        "name": "滨州"
                    },
                    {
                        "id": 802502,
                        "name": "泊头"
                    },
                    {
                        "id": 802602,
                        "name": "亳州"
                    }
                ]
            },
            {
                "initial": "C",
                "cities": [
                    {
                        "id": 802702,
                        "name": "沧州"
                    },
                    {
                        "id": 802802,
                        "name": "昌吉"
                    },
                    {
                        "id": 802902,
                        "name": "长春"
                    },
                    {
                        "id": 803102,
                        "name": "长沙"
                    },
                    {
                        "id": 803202,
                        "name": "长治"
                    },
                    {
                        "id": 803302,
                        "name": "常德"
                    },
                    {
                        "id": 803402,
                        "name": "常熟"
                    },
                    {
                        "id": 803502,
                        "name": "常州"
                    },
                    {
                        "id": 803602,
                        "name": "朝阳"
                    },
                    {
                        "id": 803702,
                        "name": "潮州"
                    },
                    {
                        "id": 803802,
                        "name": "郴州"
                    },
                    {
                        "id": 803902,
                        "name": "成都"
                    },
                    {
                        "id": 804002,
                        "name": "承德"
                    },
                    {
                        "id": 804102,
                        "name": "池州"
                    },
                    {
                        "id": 804202,
                        "name": "赤峰"
                    },
                    {
                        "id": 804302,
                        "name": "崇左"
                    },
                    {
                        "id": 804402,
                        "name": "滁州"
                    },
                    {
                        "id": 804502,
                        "name": "楚雄"
                    },
                    {
                        "id": 835702,
                        "name": "重庆"
                    }
                ]
            },
            {
                "initial": "D",
                "cities": [
                    {
                        "id": 804602,
                        "name": "达州"
                    },
                    {
                        "id": 804702,
                        "name": "大理"
                    },
                    {
                        "id": 804802,
                        "name": "大连"
                    },
                    {
                        "id": 804902,
                        "name": "大庆"
                    },
                    {
                        "id": 805002,
                        "name": "大同"
                    },
                    {
                        "id": 805102,
                        "name": "大兴安岭"
                    },
                    {
                        "id": 805202,
                        "name": "丹东"
                    },
                    {
                        "id": 805302,
                        "name": "德宏"
                    },
                    {
                        "id": 805402,
                        "name": "德阳"
                    },
                    {
                        "id": 805502,
                        "name": "德州"
                    },
                    {
                        "id": 805602,
                        "name": "定西"
                    },
                    {
                        "id": 805702,
                        "name": "定州"
                    },
                    {
                        "id": 805802,
                        "name": "东莞"
                    },
                    {
                        "id": 805902,
                        "name": "东阳"
                    },
                    {
                        "id": 806002,
                        "name": "东营"
                    },
                    {
                        "id": 806102,
                        "name": "都江堰"
                    },
                    {
                        "id": 806202,
                        "name": "都匀"
                    },
                    {
                        "id": 823602,
                        "name": "石河子"
                    },
                    {
                        "id": 823702,
                        "name": "石家庄"
                    },
                    {
                        "id": 823802,
                        "name": "石狮"
                    },
                    {
                        "id": 823902,
                        "name": "石嘴山"
                    }
                ]
            },
            {
                "initial": "E",
                "cities": [
                    {
                        "id": 806402,
                        "name": "鄂尔多斯"
                    },
                    {
                        "id": 806502,
                        "name": "恩施"
                    }
                ]
            },
            {
                "initial": "F",
                "cities": [
                    {
                        "id": 806602,
                        "name": "佛山"
                    },
                    {
                        "id": 806702,
                        "name": "福州"
                    },
                    {
                        "id": 806802,
                        "name": "抚顺"
                    },
                    {
                        "id": 806902,
                        "name": "抚州"
                    },
                    {
                        "id": 807002,
                        "name": "阜新"
                    },
                    {
                        "id": 807102,
                        "name": "阜阳"
                    }
                ]
            },
            {
                "initial": "G",
                "cities": [
                    {
                        "id": 807202,
                        "name": "赣州"
                    },
                    {
                        "id": 807302,
                        "name": "个旧"
                    },
                    {
                        "id": 807402,
                        "name": "固原"
                    },
                    {
                        "id": 807902,
                        "name": "贵港"
                    },
                    {
                        "id": 808002,
                        "name": "贵阳"
                    },
                    {
                        "id": 808102,
                        "name": "桂林"
                    },
                    {
                        "id": 808902,
                        "name": "合肥"
                    },
                    {
                        "id": 809002,
                        "name": "合作"
                    },
                    {
                        "id": 810102,
                        "name": "红河州蒙自"
                    },
                    {
                        "id": 813902,
                        "name": "句容"
                    },
                    {
                        "id": 831002,
                        "name": "邢台"
                    }
                ]
            },
            {
                "initial": "H",
                "cities": [
                    {
                        "id": 808302,
                        "name": "哈尔滨"
                    },
                    {
                        "id": 808402,
                        "name": "海口"
                    },
                    {
                        "id": 808502,
                        "name": "邯郸"
                    },
                    {
                        "id": 808602,
                        "name": "汉中"
                    },
                    {
                        "id": 808802,
                        "name": "杭州"
                    },
                    {
                        "id": 809102,
                        "name": "和田"
                    },
                    {
                        "id": 809202,
                        "name": "河池"
                    },
                    {
                        "id": 809302,
                        "name": "河源"
                    },
                    {
                        "id": 809402,
                        "name": "菏泽"
                    },
                    {
                        "id": 809502,
                        "name": "贺州"
                    },
                    {
                        "id": 809602,
                        "name": "鹤壁"
                    },
                    {
                        "id": 809702,
                        "name": "鹤岗"
                    },
                    {
                        "id": 809802,
                        "name": "黑河"
                    },
                    {
                        "id": 809902,
                        "name": "衡水"
                    },
                    {
                        "id": 810002,
                        "name": "衡阳"
                    },
                    {
                        "id": 810202,
                        "name": "呼和浩特"
                    },
                    {
                        "id": 810302,
                        "name": "呼伦贝尔"
                    },
                    {
                        "id": 810402,
                        "name": "湖州"
                    },
                    {
                        "id": 810502,
                        "name": "葫芦岛"
                    },
                    {
                        "id": 810602,
                        "name": "怀化"
                    },
                    {
                        "id": 810702,
                        "name": "淮安"
                    },
                    {
                        "id": 810802,
                        "name": "淮北"
                    },
                    {
                        "id": 810902,
                        "name": "淮南"
                    },
                    {
                        "id": 811002,
                        "name": "黄冈"
                    },
                    {
                        "id": 811102,
                        "name": "黄骅"
                    },
                    {
                        "id": 811202,
                        "name": "黄山"
                    },
                    {
                        "id": 811302,
                        "name": "黄石"
                    },
                    {
                        "id": 811402,
                        "name": "惠州"
                    },
                    {
                        "id": 831202,
                        "name": "许昌"
                    }
                ]
            },
            {
                "initial": "J",
                "cities": [
                    {
                        "id": 811502,
                        "name": "吉安"
                    },
                    {
                        "id": 811602,
                        "name": "吉林"
                    },
                    {
                        "id": 811702,
                        "name": "吉首"
                    },
                    {
                        "id": 811802,
                        "name": "济南"
                    },
                    {
                        "id": 811902,
                        "name": "济宁"
                    },
                    {
                        "id": 812002,
                        "name": "济源"
                    },
                    {
                        "id": 812102,
                        "name": "佳木斯"
                    },
                    {
                        "id": 812202,
                        "name": "嘉兴"
                    },
                    {
                        "id": 812302,
                        "name": "嘉峪关"
                    },
                    {
                        "id": 812402,
                        "name": "江门"
                    },
                    {
                        "id": 812502,
                        "name": "江阴"
                    },
                    {
                        "id": 812602,
                        "name": "江油"
                    },
                    {
                        "id": 812702,
                        "name": "焦作"
                    },
                    {
                        "id": 812802,
                        "name": "揭阳"
                    },
                    {
                        "id": 812902,
                        "name": "金华"
                    },
                    {
                        "id": 813002,
                        "name": "锦州"
                    },
                    {
                        "id": 813102,
                        "name": "晋城"
                    },
                    {
                        "id": 813202,
                        "name": "晋江"
                    },
                    {
                        "id": 813302,
                        "name": "晋中"
                    },
                    {
                        "id": 813402,
                        "name": "荆门"
                    },
                    {
                        "id": 813502,
                        "name": "荆州"
                    },
                    {
                        "id": 813602,
                        "name": "景德镇"
                    },
                    {
                        "id": 813702,
                        "name": "九江"
                    },
                    {
                        "id": 813802,
                        "name": "酒泉"
                    },
                    {
                        "id": 820402,
                        "name": "齐齐哈尔"
                    }
                ]
            },
            {
                "initial": "K",
                "cities": [
                    {
                        "id": 814002,
                        "name": "喀什"
                    },
                    {
                        "id": 814102,
                        "name": "开封"
                    },
                    {
                        "id": 814202,
                        "name": "凯里"
                    },
                    {
                        "id": 814302,
                        "name": "康定"
                    },
                    {
                        "id": 814402,
                        "name": "克拉玛依"
                    },
                    {
                        "id": 814502,
                        "name": "库尔勒"
                    },
                    {
                        "id": 814602,
                        "name": "昆明"
                    },
                    {
                        "id": 814702,
                        "name": "昆山"
                    }
                ]
            },
            {
                "initial": "L",
                "cities": [
                    {
                        "id": 814902,
                        "name": "拉萨"
                    },
                    {
                        "id": 815002,
                        "name": "莱芜"
                    },
                    {
                        "id": 815102,
                        "name": "莱阳"
                    },
                    {
                        "id": 815202,
                        "name": "兰州"
                    },
                    {
                        "id": 815302,
                        "name": "廊坊"
                    },
                    {
                        "id": 815402,
                        "name": "乐山"
                    },
                    {
                        "id": 815502,
                        "name": "丽江"
                    },
                    {
                        "id": 815602,
                        "name": "丽水"
                    },
                    {
                        "id": 815702,
                        "name": "连云港"
                    },
                    {
                        "id": 815802,
                        "name": "辽阳"
                    },
                    {
                        "id": 815902,
                        "name": "辽源"
                    },
                    {
                        "id": 816002,
                        "name": "聊城"
                    },
                    {
                        "id": 816102,
                        "name": "临安"
                    },
                    {
                        "id": 816202,
                        "name": "临沧"
                    },
                    {
                        "id": 816302,
                        "name": "临汾"
                    },
                    {
                        "id": 816402,
                        "name": "临海"
                    },
                    {
                        "id": 816502,
                        "name": "临沂"
                    },
                    {
                        "id": 816602,
                        "name": "柳州"
                    },
                    {
                        "id": 816702,
                        "name": "六安"
                    },
                    {
                        "id": 816802,
                        "name": "六盘水"
                    },
                    {
                        "id": 816902,
                        "name": "龙岩"
                    },
                    {
                        "id": 817002,
                        "name": "陇南"
                    },
                    {
                        "id": 817102,
                        "name": "娄底"
                    },
                    {
                        "id": 817202,
                        "name": "泸州"
                    },
                    {
                        "id": 817302,
                        "name": "吕梁"
                    },
                    {
                        "id": 817402,
                        "name": "罗定"
                    },
                    {
                        "id": 817502,
                        "name": "洛阳"
                    },
                    {
                        "id": 817602,
                        "name": "漯河"
                    }
                ]
            },
            {
                "initial": "M",
                "cities": [
                    {
                        "id": 817702,
                        "name": "马鞍山"
                    },
                    {
                        "id": 817802,
                        "name": "茂名"
                    },
                    {
                        "id": 817902,
                        "name": "眉山"
                    },
                    {
                        "id": 818002,
                        "name": "梅州"
                    },
                    {
                        "id": 818102,
                        "name": "绵阳"
                    },
                    {
                        "id": 818202,
                        "name": "牡丹江"
                    },
                    {
                        "id": 828002,
                        "name": "无锡"
                    }
                ]
            },
            {
                "initial": "N",
                "cities": [
                    {
                        "id": 818302,
                        "name": "内江"
                    },
                    {
                        "id": 818402,
                        "name": "南昌"
                    },
                    {
                        "id": 818502,
                        "name": "南充"
                    },
                    {
                        "id": 818602,
                        "name": "南京"
                    },
                    {
                        "id": 818702,
                        "name": "南宁"
                    },
                    {
                        "id": 818802,
                        "name": "南平"
                    },
                    {
                        "id": 818902,
                        "name": "南通"
                    },
                    {
                        "id": 819002,
                        "name": "南阳"
                    },
                    {
                        "id": 819102,
                        "name": "宁波"
                    },
                    {
                        "id": 819202,
                        "name": "宁德"
                    }
                ]
            },
            {
                "initial": "P",
                "cities": [
                    {
                        "id": 819302,
                        "name": "攀枝花"
                    },
                    {
                        "id": 819402,
                        "name": "盘锦"
                    },
                    {
                        "id": 819502,
                        "name": "蓬莱"
                    },
                    {
                        "id": 819602,
                        "name": "平顶山"
                    },
                    {
                        "id": 819702,
                        "name": "平凉"
                    },
                    {
                        "id": 819802,
                        "name": "萍乡"
                    },
                    {
                        "id": 819902,
                        "name": "莆田"
                    },
                    {
                        "id": 820002,
                        "name": "濮阳"
                    },
                    {
                        "id": 820102,
                        "name": "普洱"
                    },
                    {
                        "id": 820202,
                        "name": "普宁"
                    }
                ]
            },
            {
                "initial": "Q",
                "cities": [
                    {
                        "id": 820302,
                        "name": "七台河"
                    },
                    {
                        "id": 820502,
                        "name": "潜江"
                    },
                    {
                        "id": 820602,
                        "name": "钦州"
                    },
                    {
                        "id": 820702,
                        "name": "秦皇岛"
                    },
                    {
                        "id": 820802,
                        "name": "青岛"
                    },
                    {
                        "id": 820902,
                        "name": "青州"
                    },
                    {
                        "id": 821002,
                        "name": "清远"
                    },
                    {
                        "id": 821102,
                        "name": "庆阳"
                    },
                    {
                        "id": 821202,
                        "name": "琼海"
                    },
                    {
                        "id": 821302,
                        "name": "曲阜"
                    },
                    {
                        "id": 821402,
                        "name": "曲靖"
                    },
                    {
                        "id": 821502,
                        "name": "衢州"
                    },
                    {
                        "id": 821602,
                        "name": "泉州"
                    }
                ]
            },
            {
                "initial": "R",
                "cities": [
                    {
                        "id": 821702,
                        "name": "任丘"
                    },
                    {
                        "id": 821802,
                        "name": "日照"
                    }
                ]
            },
            {
                "initial": "S",
                "cities": [
                    {
                        "id": 821902,
                        "name": "三河"
                    },
                    {
                        "id": 822002,
                        "name": "三门峡"
                    },
                    {
                        "id": 822102,
                        "name": "三明"
                    },
                    {
                        "id": 822202,
                        "name": "三亚"
                    },
                    {
                        "id": 822302,
                        "name": "汕头"
                    },
                    {
                        "id": 822402,
                        "name": "汕尾"
                    },
                    {
                        "id": 822502,
                        "name": "商洛"
                    },
                    {
                        "id": 822602,
                        "name": "商丘"
                    },
                    {
                        "id": 822702,
                        "name": "上海"
                    },
                    {
                        "id": 822902,
                        "name": "上饶"
                    },
                    {
                        "id": 823002,
                        "name": "韶关"
                    },
                    {
                        "id": 823102,
                        "name": "邵阳"
                    },
                    {
                        "id": 823202,
                        "name": "绍兴"
                    },
                    {
                        "id": 823302,
                        "name": "深圳"
                    },
                    {
                        "id": 823402,
                        "name": "沈阳"
                    },
                    {
                        "id": 823502,
                        "name": "十堰"
                    },
                    {
                        "id": 824002,
                        "name": "双鸭山"
                    },
                    {
                        "id": 824102,
                        "name": "朔州"
                    },
                    {
                        "id": 824202,
                        "name": "四平"
                    },
                    {
                        "id": 824302,
                        "name": "松原"
                    },
                    {
                        "id": 824402,
                        "name": "苏州"
                    },
                    {
                        "id": 824602,
                        "name": "宿迁"
                    },
                    {
                        "id": 824702,
                        "name": "宿州"
                    },
                    {
                        "id": 824802,
                        "name": "绥化"
                    },
                    {
                        "id": 824902,
                        "name": "随州"
                    },
                    {
                        "id": 825002,
                        "name": "遂宁"
                    },
                    {
                        "id": 829302,
                        "name": "厦门"
                    }
                ]
            },
            {
                "initial": "T",
                "cities": [
                    {
                        "id": 825202,
                        "name": "台州"
                    },
                    {
                        "id": 825302,
                        "name": "太仓"
                    },
                    {
                        "id": 825402,
                        "name": "太原"
                    },
                    {
                        "id": 825502,
                        "name": "泰安"
                    },
                    {
                        "id": 825602,
                        "name": "泰州"
                    },
                    {
                        "id": 825702,
                        "name": "唐山"
                    },
                    {
                        "id": 825802,
                        "name": "滕州"
                    },
                    {
                        "id": 825902,
                        "name": "天津"
                    },
                    {
                        "id": 826002,
                        "name": "天水"
                    },
                    {
                        "id": 826102,
                        "name": "铁岭"
                    },
                    {
                        "id": 826202,
                        "name": "通化"
                    },
                    {
                        "id": 826302,
                        "name": "通辽"
                    },
                    {
                        "id": 826402,
                        "name": "桐城"
                    },
                    {
                        "id": 826502,
                        "name": "铜川"
                    },
                    {
                        "id": 826602,
                        "name": "铜陵"
                    },
                    {
                        "id": 826702,
                        "name": "铜仁"
                    }
                ]
            },
            {
                "initial": "W",
                "cities": [
                    {
                        "id": 826802,
                        "name": "皖亳州"
                    },
                    {
                        "id": 826902,
                        "name": "威海"
                    },
                    {
                        "id": 827002,
                        "name": "潍坊"
                    },
                    {
                        "id": 827102,
                        "name": "渭南"
                    },
                    {
                        "id": 827302,
                        "name": "温州"
                    },
                    {
                        "id": 827402,
                        "name": "文昌"
                    },
                    {
                        "id": 827502,
                        "name": "文山"
                    },
                    {
                        "id": 827602,
                        "name": "乌海"
                    },
                    {
                        "id": 827702,
                        "name": "乌兰察布"
                    },
                    {
                        "id": 827802,
                        "name": "乌兰浩特"
                    },
                    {
                        "id": 827902,
                        "name": "乌鲁木齐"
                    },
                    {
                        "id": 828102,
                        "name": "吴江"
                    },
                    {
                        "id": 828202,
                        "name": "芜湖"
                    },
                    {
                        "id": 828302,
                        "name": "梧州"
                    },
                    {
                        "id": 828402,
                        "name": "五家渠"
                    },
                    {
                        "id": 828502,
                        "name": "武汉"
                    },
                    {
                        "id": 828602,
                        "name": "武威"
                    },
                    {
                        "id": 828702,
                        "name": "武夷山"
                    }
                ]
            },
            {
                "initial": "X",
                "cities": [
                    {
                        "id": 828802,
                        "name": "西安"
                    },
                    {
                        "id": 828902,
                        "name": "西昌"
                    },
                    {
                        "id": 829002,
                        "name": "西宁"
                    },
                    {
                        "id": 829102,
                        "name": "西双版纳"
                    },
                    {
                        "id": 829202,
                        "name": "锡林浩特"
                    },
                    {
                        "id": 829402,
                        "name": "仙桃"
                    },
                    {
                        "id": 829502,
                        "name": "咸宁"
                    },
                    {
                        "id": 829602,
                        "name": "咸阳"
                    },
                    {
                        "id": 829702,
                        "name": "香港"
                    },
                    {
                        "id": 829902,
                        "name": "湘潭"
                    },
                    {
                        "id": 830002,
                        "name": "湘西"
                    },
                    {
                        "id": 830102,
                        "name": "襄樊"
                    },
                    {
                        "id": 830202,
                        "name": "襄阳"
                    },
                    {
                        "id": 830302,
                        "name": "孝感"
                    },
                    {
                        "id": 830402,
                        "name": "忻州"
                    },
                    {
                        "id": 830502,
                        "name": "新乡"
                    },
                    {
                        "id": 830602,
                        "name": "新余"
                    },
                    {
                        "id": 830702,
                        "name": "信阳"
                    },
                    {
                        "id": 830802,
                        "name": "兴城"
                    },
                    {
                        "id": 830902,
                        "name": "兴义"
                    },
                    {
                        "id": 831102,
                        "name": "徐州"
                    },
                    {
                        "id": 831302,
                        "name": "宣城"
                    }
                ]
            },
            {
                "initial": "Y",
                "cities": [
                    {
                        "id": 831402,
                        "name": "雅安"
                    },
                    {
                        "id": 831502,
                        "name": "烟台"
                    },
                    {
                        "id": 831602,
                        "name": "延安"
                    },
                    {
                        "id": 831702,
                        "name": "延吉"
                    },
                    {
                        "id": 831802,
                        "name": "盐城"
                    },
                    {
                        "id": 831902,
                        "name": "扬州"
                    },
                    {
                        "id": 832002,
                        "name": "阳江"
                    },
                    {
                        "id": 832102,
                        "name": "阳泉"
                    },
                    {
                        "id": 832202,
                        "name": "杨凌"
                    },
                    {
                        "id": 832302,
                        "name": "伊春"
                    },
                    {
                        "id": 832402,
                        "name": "伊宁"
                    },
                    {
                        "id": 832502,
                        "name": "宜宾"
                    },
                    {
                        "id": 832602,
                        "name": "宜昌"
                    },
                    {
                        "id": 832702,
                        "name": "宜春"
                    },
                    {
                        "id": 832802,
                        "name": "宜兴"
                    },
                    {
                        "id": 832902,
                        "name": "义乌"
                    },
                    {
                        "id": 833002,
                        "name": "益阳"
                    },
                    {
                        "id": 833102,
                        "name": "银川"
                    },
                    {
                        "id": 833202,
                        "name": "鹰潭"
                    },
                    {
                        "id": 833302,
                        "name": "营口"
                    },
                    {
                        "id": 833402,
                        "name": "永安"
                    },
                    {
                        "id": 833502,
                        "name": "永城"
                    },
                    {
                        "id": 833602,
                        "name": "永州"
                    },
                    {
                        "id": 833702,
                        "name": "榆林"
                    },
                    {
                        "id": 833802,
                        "name": "禹城"
                    },
                    {
                        "id": 833902,
                        "name": "玉林"
                    },
                    {
                        "id": 834002,
                        "name": "玉溪"
                    },
                    {
                        "id": 834102,
                        "name": "岳阳"
                    },
                    {
                        "id": 834202,
                        "name": "运城"
                    }
                ]
            },
            {
                "initial": "Z",
                "cities": [
                    {
                        "id": 834302,
                        "name": "枣庄"
                    },
                    {
                        "id": 834402,
                        "name": "增城"
                    },
                    {
                        "id": 834502,
                        "name": "湛江"
                    },
                    {
                        "id": 834602,
                        "name": "张家港"
                    },
                    {
                        "id": 834702,
                        "name": "张家界"
                    },
                    {
                        "id": 834802,
                        "name": "张家口"
                    },
                    {
                        "id": 834902,
                        "name": "张掖"
                    },
                    {
                        "id": 835002,
                        "name": "漳州"
                    },
                    {
                        "id": 835102,
                        "name": "樟树"
                    },
                    {
                        "id": 835202,
                        "name": "肇庆"
                    },
                    {
                        "id": 835302,
                        "name": "镇江"
                    },
                    {
                        "id": 835402,
                        "name": "镇江扬中"
                    },
                    {
                        "id": 835502,
                        "name": "郑州"
                    },
                    {
                        "id": 835602,
                        "name": "中山"
                    },
                    {
                        "id": 835902,
                        "name": "舟山"
                    },
                    {
                        "id": 836002,
                        "name": "周口"
                    },
                    {
                        "id": 836102,
                        "name": "株洲"
                    },
                    {
                        "id": 836202,
                        "name": "珠海"
                    },
                    {
                        "id": 836302,
                        "name": "诸城"
                    },
                    {
                        "id": 836402,
                        "name": "驻马店"
                    },
                    {
                        "id": 836502,
                        "name": "淄博"
                    },
                    {
                        "id": 836602,
                        "name": "遵义"
                    }
                ]
            }
        ]
    }
}